
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.definition-importer-password
  * azurerm_key_vault_secret.definition-importer-username
* Update
  * module.finrem-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.finrem-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.finrem-vault.azurerm_key_vault_access_policy.developer[0]
  * module.finrem-vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;2295eb47-eef8-4d63-aabe-509a7b4ef748&#34;]
  * module.finrem-vault.azurerm_key_vault_access_policy.product_team_access_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.definition-importer-password will be created
  + resource "azurerm_key_vault_secret" "definition-importer-password" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/"
      + name           = "definition-importer-password"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.definition-importer-username will be created
  + resource "azurerm_key_vault_secret" "definition-importer-username" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/"
      + name           = "definition-importer-username"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.finrem-vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        certificate_permissions = [
            "Create",
            "Delete",
            "DeleteIssuers",
            "Get",
            "GetIssuers",
            "Import",
            "List",
            "ListIssuers",
            "SetIssuers",
            "Update",
            "ManageContacts",
            "ManageIssuers",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31" -> (known after apply)
        key_permissions         = [
            "Create",
            "List",
            "Get",
            "Delete",
            "Update",
            "Import",
            "Backup",
            "Restore",
            "Decrypt",
            "Encrypt",
            "UnwrapKey",
            "WrapKey",
            "Sign",
            "Verify",
        ]
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/"
        object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
        secret_permissions      = [
            "Set",
            "List",
            "Get",
            "Delete",
            "Recover",
            "Purge",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.finrem-vault.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
        certificate_permissions = [
            "Get",
            "List",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
        key_permissions         = [
            "Get",
            "List",
        ]
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/"
        object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
        secret_permissions      = [
            "Get",
            "List",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.finrem-vault.azurerm_key_vault_access_policy.managed_identity_access_policy["2295eb47-eef8-4d63-aabe-509a7b4ef748"] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
        certificate_permissions = [
            "Get",
            "List",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/objectId/2295eb47-eef8-4d63-aabe-509a7b4ef748" -> (known after apply)
        key_permissions         = [
            "Get",
            "List",
        ]
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/"
        object_id               = "2295eb47-eef8-4d63-aabe-509a7b4ef748"
        secret_permissions      = [
            "Get",
            "List",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.finrem-vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
        certificate_permissions = [
            "List",
            "Update",
            "Create",
            "Import",
            "Delete",
            "ManageContacts",
            "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
            "SetIssuers",
            "DeleteIssuers",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/objectId/f2ef9d16-488a-4b84-b433-3eb4225923cb" -> (known after apply)
        key_permissions         = [
            "List",
            "Update",
            "Create",
            "Import",
            "Delete",
        ]
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/"
        object_id               = "f2ef9d16-488a-4b84-b433-3eb4225923cb"
        secret_permissions      = [
            "List",
            "Set",
            "Delete",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.finrem-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/|finrem-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "finrem-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/finrem-aat/providers/Microsoft.KeyVault/vaults/finrem-aat/"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 6 to add, 1 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Vars":{}} -->